erp3l/src/Documents/ПодготовкаКПередачеОС/ПодготовкаКПередачеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПодготовкаКПередачеОС</name>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.ПереданныеВАрендуОС</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияОС</registerRecords>
  <registerRecords>InformationRegister.ПорядокУчетаОСБУ</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>InformationRegister.УдалитьСостоянияОСОрганизаций</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.УдалитьНачислениеАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <registerRecords>InformationRegister.УдалитьНачислениеАмортизацииОСНалоговыйУчет</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПодготовкиОС</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередачаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВыбытияОС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПередачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетГрузоотправителя</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетГрузополучателя</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Отпустил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпустилДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПередачиОС</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддержкаОтложенногоПереходаПрав</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленнаяАмортизация</name>
    <attributes>
      <name>ОбъектУчета</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНУ</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПР</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВР</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоАмортизационнаяПремия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАмортизационнойПремии</name>
      <type>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.МодернизацияОС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПередаватьРасходыВДругуюОрганизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияПолучательРасходов</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетПередачиРасходов</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЦелевыеСредства</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Enums/ВидыСобытийОС/ВидыСобытийОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСобытийОС</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ПринятиеКУчету</name>
  </enumValues>
  <enumValues>
    <name>ВводВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуСВводомВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>НачислениеАмортизации</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееПеремещение</name>
  </enumValues>
  <enumValues>
    <name>ТекущийРемонт</name>
  </enumValues>
  <enumValues>
    <name>СреднийРемонт</name>
  </enumValues>
  <enumValues>
    <name>КапитальныйРемонт</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>Реконструкция</name>
  </enumValues>
  <enumValues>
    <name>Достройка</name>
  </enumValues>
  <enumValues>
    <name>Дооборудование</name>
  </enumValues>
  <enumValues>
    <name>ЧастичнаяЛиквидация</name>
  </enumValues>
  <enumValues>
    <name>Модернизация</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаКПередаче</name>
  </enumValues>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочие состояния (пользовательские)</comment>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
  <enumValues>
    <name>ПринятоКЗабалансовомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаключенДоговорАренды</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Documents/ПодготовкаКПередачеОС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		Если ТипДанныхЗаполнения = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ПодготовкаКПередачеОС.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
	ИнициализироватьДокумент();	

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПараметрыЗаполнения = Документы.ПодготовкаКПередачеОС.ПараметрыЗаполненияНалогообложенияНДСПродажи(ЭтотОбъект);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(НалогообложениеНДС, ПараметрыЗаполнения);
	
	УчетНДСУП.СкорректироватьСтавкуНДСВТЧДокумента(ЭтотОбъект, ОС);
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ВнеоборотныеАктивы.ПроверитьСоответствиеДатыВерсииУчета(ЭтотОбъект, Ложь, Отказ);
	
	ВнеоборотныеАктивы.ПроверитьОтсутствиеДублейВТабличнойЧасти(ЭтотОбъект, "ОС", "ОсновноеСредство", Отказ);
	
	Если ПоддержкаОтложенногоПереходаПрав Или Не ПередачаВыполнена Тогда
		НепроверяемыеРеквизиты.Добавить("СтатьяРасходов");
		НепроверяемыеРеквизиты.Добавить("АналитикаРасходов");
	Иначе
		ПараметрыВыбораСтатейИАналитик = Документы.ПодготовкаКПередачеОС.ПараметрыВыбораСтатейИАналитик();
		ДоходыИРасходыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ПараметрыВыбораСтатейИАналитик);
	КонецЕсли;
	
	Если Не ПередачаВыполнена Тогда
		НепроверяемыеРеквизиты.Добавить("ДатаПередачи");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РассчитатьАмортизацию(Отказ);
		УстановитьПараметрыВыборочнойРегистрацииКОтражениюВРеглУчете();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПодготовкаКПередачеОС.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ПередЗаписью(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаРеквизитов = ТаблицаРеквизитовДокумента();
	
	Документы.ПодготовкаКПередачеОС.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(
		НСтр("ru = 'Подготовка к передаче ОС';
			|en = 'Preparation for FA handover'"));
	
	УчетОСВызовСервера.ПроверитьСоответствиеОСОрганизации(ЭтотОбъект.ОС.Выгрузить(), ТаблицаРеквизитов, Отказ);
	УчетОСВызовСервера.ПроверитьСостояниеОСПринятоКУчету(ЭтотОбъект.ОС.Выгрузить(), ТаблицаРеквизитов, Отказ);
	УчетОСВызовСервера.ПроверитьСоответствиеМестонахожденияОС(ЭтотОбъект.ОС.Выгрузить(), ТаблицаРеквизитов, Отказ);
	УчетОСВызовСервера.ПроверитьЗаполнениеСчетаУчетаОС(ЭтотОбъект.ОС.Выгрузить(), ТаблицаРеквизитов, Отказ);
	
	ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	ДопПараметры.ДополнительныеСвойства = ДополнительныеСвойства;
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ, ДопПараметры);
	
	Если Не Отказ Тогда
		РеглУчетПроведениеСервер.ОтразитьДокумент(Новый Структура("Ссылка, Дата, Организация", Ссылка, Дата));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Ответственный, Подразделение);
	
	Если Не ЗначениеЗаполнено(СобытиеПодготовкиОС) Тогда
		СобытиеПодготовкиОС = УчетОСВызовСервера.ПолучитьСобытиеПоОСИзСправочника(Перечисления.ВидыСобытийОС.ПодготовкаКПередаче);
	КонецЕсли;
	
	ПоддержкаОтложенногоПереходаПрав = Истина;
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПодготовкаКПередачеОС.ПараметрыВыбораСтатейИАналитик();
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
	
КонецПроцедуры

Функция ТаблицаРеквизитовДокумента()
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	&Ссылка КАК Регистратор,
		|	&Дата КАК Период,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ДатаРасчета,
		|	&Номер,
		|	&Организация,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК СостояниеОС,
		|	""ОС"" КАК ИмяСписка,
		|	ИСТИНА КАК ВыдаватьСообщения,
		|	&Подразделение КАК Подразделение,
		|	НЕОПРЕДЕЛЕНО КАК МОЛ");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура РассчитатьАмортизацию(Отказ)
	
	НачисленнаяАмортизация.Очистить();
	
	ТаблицаНачисленнаяАмортизация = УчетОСВызовСервера.НачисленнаяАмортизация(
		ОС.Выгрузить(, "НомерСтроки, ОсновноеСредство"), ТаблицаРеквизитовДокумента(),, Отказ);
	
	ДополнительныеСвойства.Вставить("НачисленнаяАмортизация", ТаблицаНачисленнаяАмортизация);
	НачисленнаяАмортизация.Загрузить(ТаблицаНачисленнаяАмортизация);
	
КонецПроцедуры

Процедура УстановитьПараметрыВыборочнойРегистрацииКОтражениюВРеглУчете()
	
	Если НЕ Проведен Тогда
		Возврат;
	КонецЕсли;
	
	НепроверяемыеРеквизиты = Новый Структура;
	НепроверяемыеРеквизиты.Вставить("Комментарий");
	
	ИзмененияДокумента = ОбщегоНазначенияУТ.ИзмененияДокумента(ЭтотОбъект, НепроверяемыеРеквизиты);
	
	Если ИзмененияДокумента.Свойство("ТабличныеЧасти") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПередачиОС = Новый Структура;
	РеквизитыПередачиОС.Вставить("ПередачаВыполнена");
	РеквизитыПередачиОС.Вставить("СобытиеПередачиОС");
	РеквизитыПередачиОС.Вставить("ДатаПередачи");
	
	РегистрацияТолькоПоДатеПередачи = Истина;
	
	Если ИзмененияДокумента.Свойство("Реквизиты") Тогда
		
		Для каждого Реквизит Из ИзмененияДокумента.Реквизиты Цикл
			Если Реквизит.Имя = "ДатаПередачи" И НачалоДня(Реквизит.СтароеЗначение) = НачалоДня(Дата) Тогда
				РегистрацияТолькоПоДатеПередачи = Ложь;
				Прервать;
			КонецЕсли;
			Если НЕ РеквизитыПередачиОС.Свойство(Реквизит.Имя) Тогда
				РегистрацияТолькоПоДатеПередачи = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ РегистрацияТолькоПоДатеПередачи Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаВыборочнойРегистрации = РеглУчетПроведениеСервер.ТаблицаВыборочнойРегистрацииКОтражению();
	РеглУчетПроведениеСервер.ДобавитьПараметрыВыборочнойРегистрацииКОтражениюВРеглУчете(
		ТаблицаВыборочнойРегистрации, Организация, ДатаПередачи);
	ПроведениеДокументов.ДобавитьТаблицуДанныхДокумента(ЭтотОбъект,
		"ТаблицаВыборочнойРегистрацииКОтражению", ТаблицаВыборочнойРегистрации);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
